Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པའོ། །ཞེས་བྱ་བ་ནི་འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ།
en: It is said, “consciousness is dependent upon the formations,” which means that the formations as a condition are the continuation of consciousness and a basis for consciousness.

source: །རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས་ཤེས་བྱ་བ་ནི་རྣམ་པར་ཤེས་བའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ།
en: It is said, “name-and-form are dependent upon consciousness,” which means that consciousness as a condition is the continuation of name-and-form and a basis for name-and-form.

source: །མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་དྲུག་གི་སྐྱེ་མཆེད་ཅེས་བྱ་བ་ནི་མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་དྲུག་གི་སྐྱེ་མཆེད་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ། །དྲུག་གི་སྐྱེ་མཆེད་ཀྱི་རྐྱེན་གྱིས་རེག་པའོ།
en: It is said, “the six sensory bases are dependent upon name-and-form,” which means that name-and-form as a condition is the continuation of the six sensory bases and a basis for the six sensory bases.

source: ཞེས་བྱ་བ་ནི་དྲུག་གི་སྐྱེ་མཆེད་ཀྱི་རྐྱེན་གྱིས་རེག་པ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ། །རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: It is said, “contact is dependent upon the six sensory bases,” which means that the six sensory bases as a condition are the continuation of contact and a basis for contact.

source: །ཞེས་བྱ་བ་ནི་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྒྱུན་མི་འཆད་ཅིང་སྟོན་པའོ། །ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པའོ།
en: It is said, “sensation is dependent upon contact,” which means that contact as a condition is the continuation of sensation and a basis for sensation.

source: །ཞེས་བྱ་བ་ནི་ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ། །སྲེད་པའི་རྐྱེན་གྱིས་ཉེ་བར་ལེན་པའོ།
en: It is said, “craving is dependent upon sensation,” which means that sensation as a condition is the continuation of craving and a basis for craving.

source: །ཞེས་བྱ་བ་ནི་སྲེད་པའི་རྐྱེན་གྱིས་ཉེ་བར་ལེན་པ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ། །ཉེ་བར་ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པའོ།
en: It is said, “grasping is dependent upon craving,” which means that craving as a condition is the continuation of grasping and a basis for grasping.

source: །ཞེས་བྱ་བ་ནི་ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ།
en: It is said, “becoming is dependent upon grasping,” which means that grasping as a condition is the continuation of becoming and a basis for becoming.

source: །སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བའོ། །ཞེས་བྱ་བ་ནི་སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ།
en: It is said, “birth is dependent upon becoming,” which means that becoming as a condition is the continuation of birth and a basis for birth.

source: །སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤིའོ་ཞེས་བྱ་བ་ནི་སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་རྒྱུན་མི་འཆད་ཅིང་རྟོན་པའོ། །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག་གོ།
en: It is said, “aging and death is dependent upon birth,” which means that birth as a condition is the continuation of aging and death and a basis for aging and death.

source: །ཞེས་བྱ་བ་ནི་མ་རིག་པའི་རྐྱེན་མེད་པས་འདུ་བྱེད་རྣམས་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: ‘It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means that when there is no ignorance as a condition, there is the discontinuity of the formations and the absence of a basis for formations.

source: །འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག་གོ། །ཞེས་བྱ་བ་ནི་འདུ་བྱེད་ཀྱི་རྐྱེན་མེད་པས་རྣམ་པར་ཤེས་པ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ། །རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག་གོ།
en: It is said, “Through the cessation of formation there is the cessation of consciousness,” which means that when there is no formation as a condition, there is the discontinuity of consciousness and the absence of a basis for consciousness.

source: །ཞེས་བྱ་བ་ནི་རྣམ་པར་ཤེས་པའི་རྐྱེན་མེད་པས་མིང་དང་གཟུགས་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ། །མིང་དང་གཟུགས་འགགས་པས་དྲུག་གི་སྐྱེ་མཆེད་འགག་གོ། །ཞེས་བྱ་བ་ནི་མིང་དང་གཟུགས་ཀྱི་རྐྱེན་མེད་པས་དྲུག་གི་སྐྱེ་མཆེད་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of consciousness there is the cessation of the six sensory bases,” which means that when there is no consciousness as a condition, there is the discontinuity of the six sensory bases and the absence of a basis for the six sensory bases.

source: །དྲུག་གི་སྐྱེ་མཆེད་འགགས་པས་རེག་པ་འགག་གོ། །ཞེས་བྱ་བ་ནི་དྲུག་གི་སྐྱེ་མཆེད་ཀྱི་རྐྱེན་མེད་པས་རེག་པ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of the six sensory bases there is the cessation of contact,” which means that when there are no six sensory bases as a condition, there is the discontinuity of contact and the absence of a basis for contact.

source: །རེག་པ་འགགས་པས་ཚོར་བ་འགག་གོ །ཞེས་བྱ་བ་ནི་རེག་པའི་རྐྱེན་མེད་པས་ཚོར་བ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of contact there is the cessation of sensation,” which means that when there is no contact as a condition, there is the discontinuity of sensation and the absence of a basis for sensation.

source: །ཚོར་བ་འགགས་པས་སྲེད་པ་འགག་གོ །ཞེས་བྱ་བ་ནི་ཚོར་བའི་རྐྱེན་མེད་པས་སྲེད་པ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ། །སྲིད་པ་འགགས་པས་ལེན་པ་འགག་གོ །ཞེས་བྱ་བ་ནི་སྲེད་པའི་རྐྱེན་མེད་པས་ལེན་པ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of sensation there is the cessation of craving,” which means that when there is no sensation as a condition, there is the discontinuity of craving and the absence of a basis for craving.

source: །ཉེ་བར་ལེན་པ་འགགས་པས་སྲིད་པ་འགག་གོ །ཞེས་བྱ་བ་ནི་ཉེ་བར་ལེན་པའི་རྐྱེན་མེད་པས་སྲིད་པ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of craving there is the cessation of becoming,” which means that when there is no craving as a condition, there is the discontinuity and lack of support for becoming.

source: །སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག་གོ །ཞེས་བྱ་བ་ནི་སྲིད་པའི་རྐྱེན་མེད་པས་སྐྱེ་བ་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of becoming there is the cessation of birth,” which means that when there is no becoming as a condition, there is the discontinuity and lack of support for birth.

source: སྐྱེ་བ་འགགས་པས་རྒ་ཤི་འགག་གོ །ཞེས་བྱ་བ་ནི་སྐྱེ་བའི་རྐྱེན་མེད་པས་རྒ་ཤི་ཉེ་བར་ཞི་ཞིང་རྟོན་པ་མེད་པའོ།
en: It is said, “Through the cessation of birth there is the cessation of aging and death,” which means that when there is no birth as a condition, there is the discontinuity and lack of support for aging and death.

source: །དེ་ལ་མ་རིག་པ་དང་སྲིད་པ་དང་ཉེ་བར་ལེན་པ་ནི་ཉོན་མོངས་པའི་ལམ་གྱི་རྒྱུན་མི་འཆད་པའོ།
en: ‘Ignorance, craving, and grasping are the uninterrupted presence of the kleśas.

source: །འདུ་བྱེད་དང་སྲིད་པ་ནི་ལས་ཀྱི་ལམ་གྱི་རྒྱུན་མི་འཆད་པའོ།
en: Formation and becoming are the uninterrupted presence of karma.

source: །ལྷག་མ་རྣམས་ནི་སྡུག་བསྔལ་གྱི་ལམ་གྱི་རྒྱུན་མི་འཆད་པའོ།
en: The others are the uninterrupted presence of suffering.

source: །རབ་ཏུ་རྣམ་པར་ཕྱེ་བས་སྔུན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་འགགས་པས་ལམ་གྱི་རྒྱུན་མི་འཆད་པའོ།
en: ‘In terms of this subdivision, when there is the cessation of that which precedes and that which succeeds, their presence is discontinued.

source: །དེ་ལྟར་ལམ་འདི་གསུམ་ནི་བདག་མེད་ཅིང་བདག་དང་བདག་གི་དང་བྲལ་བར་འབྱུང་ཞིང་འཇིག་པ་སྟེ།
en: In that way these three processes have no self, no being, no soul, no spirit, and no person, and there is the absence of anything that belongs to a self and there is nothing that pertains to a self. They arise and cease.

source: རང་བཞིན་གྱིས་མདུང་ཁྱིམ་ལྟ་བུའོ།
en: They are like a bundle of reeds.

source: །དེ་ལྟར་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཤེས་བྱ་བ་འདི་ནི་སྔོན་གྱི་མཐའ་ལ་བལྟས་པའོ།
en: ‘Also, when it is said, “The formations have ignorance as their condition,” it means that they are related to the past.

source: །རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་དྲུག་གི་སྐྱེ་མཆེད་དང་རེག་པ་དང་། ཚོར་བ་འདི་དག་ནི་ད་ལྟར་བྱུང་བ་ལ་བལྟས་པའོ།
en: Consciousness, name-and-form, the six sensory bases, contact, and sensation are related to the present.

source: །སྲེད་པ་དང་ཉེ་བར་ལེན་པ་དང་སྲིད་པ་དང་། སྐྱེ་བ་ཞེས་བྱ་བ་འདི་ནི་ཕྱི་མའི་མཐའ་ལ་བལྟས་པ་སྟེ།
en: Craving, grasping, becoming, and birth are related to the future.

source: དེ་ཕན་ཆད་དུ་འང་དེ་དག་རྒྱུན་དུ་འབྱུང་ངོ་། །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག་ཅེས་བྱ་བ་འདི་ནི་ལྟ་བ་རྒྱུན་ཆད་པ་སྟེ་ལྷག་མ་རྣམས་ཀྱང་དེ་བཞིན་ནོ།
en: It is said, “This continues onwards.” It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means that the relationship is discontinued.

source: །ཡང་འདི་ལྟར་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་པོ་འདི་དག་གི་རྒྱུས་སྡུག་བསྔལ་གསུམ་འབྱུང་སྟེ།
en: ‘Moreover, the three sufferings arise in the twelve components of existence.

source: དེ་ལ་མ་རིག་པ་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་། གཟུགས་དང་། དྲུག་གི་སྐྱེ་མཆེད་ཅེས་བྱ་བ་ནི། འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་ལོ།
en: Ignorance, the formations, consciousness, name-and-form, and the six sensory bases are the suffering of composite phenomena.

source: །རེག་པ་དང་ཚོར་བ་ཞེས་བྱ་བ་འདི་ནི་སྡུག་བསྔལ་གྱི་ཡང་སྡུག་བསྔལ་ལོ།
en: Contact and sensation are the suffering of suffering.

source: །སྲེད་པ་དང་ཉེ་བར་ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་ནས་འཁྲུག་པ་ཞེས་བྱ་བའི་བར་འདི་ནི་འགྱུར་བའི་སྡུག་བསྔལ་ལོ།
en: Craving, grasping, becoming, birth, and so on, up to distress, are the suffering of change.

source: །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་རྣམས་འགག་ཅེས་བྱ་བ་འདི་ནི་སྡུག་བསྔལ་གསུམ་གྱི་རྒྱུན་ཆད་པའོ།
en: ‘It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means that the continuity of the three sufferings ceases.

source: །མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཤེས་བྱ་བ་ནི་འདུ་བྱེད་རྣམས་རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བ་སྟེ།
en: ‘It is said, “The formations have ignorance as their condition,” which means that the formations arise from cause and condition.

source: ལྷག་མ་རྣམས་ཀྱང་དེ་བཞིན་ནོ།
en: It is the same for the rest.

source: །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་ཅེས་བྱ་བ་ནི། འདུ་བྱེད་རྣམས་མེད་པ་སྟེ།
en: ‘It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means the extinction of the formations.

source: །མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཤེས་བྱ་བ་ནི་སྐྱེ་བ་རྣམ་པར་འབྲེལ་བ་སྟེ།
en: ‘It is said, “The formations have ignorance as their condition,” which means this is a connection through production.

source: །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་ཅེས་བྱ་བ་ནི། འཇིག་པ་རྣམ་པར་འབྲེལ་བ་སྟེ།
en: ‘It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means this is a connection through elimination.

source: །མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ཤེས་བྱ་བ་ནི་སྲིད་པ་ལུགས་སུ་འཐུན་པར་བརྟག་པ་སྟེ།
en: ‘It is said, “The formations have ignorance as their condition,” which means an analysis of progressive generation.

source: །མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་ཅེས་བྱ་བ་ནི་ཟད་པ་དང་འཇིག་པའི་ལུགས་སུ་འཐུན་པར་བརྟག་པ་སྟེ།
en: ‘It is said, “Through the cessation of ignorance there is the cessation of the formations,” which means an analysis of progressive termination and elimination.

source: །ཞེས་དེ་ལྟར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་ལུགས་སུ་འཐུན་པ་དང་། མི་འཐུན་པའི་ཚུལ་དུ་རབ་ཏུ་རྟོག་སྟེ།
en: “He thus investigates ten aspects of dependent origination in their progressive development and negation: he investigates (1) the sequential connection of the components of existence; ( ) their combination in one mind; (3) each having its own distinct activity; (4) their not being separate from one another; (5) their following the three processes;

source: འདི་ལྟར་སྲིད་པའི་ཡན་ལག་རྗེས་སུ་འབྲེལ་བ་དང་། སེམས་གཅིག་ཏུ་ཡང་དག་པར་འདུ་བ་དང་། རང་གི་ལས་མ་འདྲེས་པ་དང་། ཆེད་དུ་བྱེད་པ་མེད་པ་དང་ལམ་གསུམ་གྱི་རྒྱུད་དུ་འགྲང་བ་དང་། སྔོན་གྱི་མཐའ་དང་ད་ལྟར་བྱུང་བ་དང་། ཕྱི་མའི་མཐའ་ལ་བལྟ་བ་དང་། སྡུག་བསྔལ་གསུམ་འབྱུང་བ་དང་། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བ་དང་། སྐྱེ་བ་དང་འཇིག་པ་རྣམ་པར་འབྲེལ་བ་དང་། སྲིད་པའི་ལུགས་སུ་འཐུན་པ་དང་། ཟད་པར་འགྱུར་བར་རབ་ཏུ་རྟོག་པའོ།
en: (6) their relationship to the past, the present, and the future; (7) their aggregation of the three sufferings; (8) their arising from causes and conditions; (9) their connection through generation and elimination; and (10) the process of becoming and of termination.

source: །དེ་དེ་ལྟར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་རྣམ་པ་བཅུར་རབ་ཏུ་རྟོག་ཅིང་བདག་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་དང་། རང་བཞིན་གྱིས་བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་མེད་པར་རབ་ཏུ་རྟོག་པའི་ཚེ། སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེས་པ་ཡིན།
en: “In that way, through his examination of the ten aspects of dependent origination, he examines no self, no being, no soul, no person, emptiness by nature, and the natural absence of a doer or experiencer, and there arises the door to liberation that is emptiness.

source: སྲིད་པའི་ཡན་ལག་འདི་དག་གི་རང་བཞིན་འགགས་ཤིང་རྣམ་པར་ཐར་པ་ལ་ཤིན་ཏུ་ཉེ་བར་གནས་པས་ཆོས་ཀྱི་མཚན་མ་གང་ཡང་མི་སྐྱེ་སྟེ་དེས་དེའི་མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེས་པ་ཡིན།
en: “In that way he comes near to liberation through the cessation of the nature of the components of existence, and there arises the door to liberation that is featurelessness.

source: དེ་ལྟར་དེ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་ལ་ཞུགས་པས་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་གཏོང་ཞིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མ་གཏོགས་པར་འདོད་པ་གང་ཡང་མི་སྐྱེ་སྟེ་དེས་དེའི་སྨོན་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྐྱེས་པ་ཡིན།
en: “In that way he comprehends emptiness and featurelessness; there does not arise any desire whatsoever other than for ripening beings, which is preceded by compassion, and there arises the door to liberation that is aspirationlessness.

source: དེ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་འདི་དག་སྒོམ་པས་བདག་དང་ཕ་རོལ་གྱི་འདུ་ཤེས་དང་བྲལ་བ་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོའི་འདུ་ཤེས་དང་བྲལ་བ་དང་། ཡོད་པ་དང་མེད་པའི་འདུ་ཤེས་དང་བྲལ་བས།
en: “He who meditates on these three doors to liberation is freed from the identifications of self and other, freed from the identifications of doer and experiencer, and freed from the identifications of existence and nonexistence.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་མ་རྫོགས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་སྟེ། དེ་བས་ཀྱང་ཤིན་ཏུ་བརྩོན་པར་བྱེད་དོ།
en: With all-preceding great compassion there is even greater application, and the incomplete factors for enlightenment are completed.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདུ་བ་ཡོད་པས་ནི་འདུས་བྱས་འཕེལ་བར་འགྱུར་རོ།
en: “He thinks, ‘When there are combinations, composite phenomena arise.

source: །འདུ་བ་དང་བྲལ་བས་ནི་འཕེལ་བ་མེད་དོ།
en: When there are no combinations, they do not arise.

source: །རྒྱུ་རྐྱེན་དང་ལྡན་པས་ནི་འདུ་བྱེད་འཕེལ་བར་འགྱུར་རོ།
en: When there are entireties, composite phenomena arise.

source: །རྒྱུ་རྐྱེན་དང་མི་ལྡན་པས་ནི་འཕེལ་བ་མེད་དོ།
en: When there is the absence of the entirety of necessary factors, composite phenomena do not arise.

source: །དེ་ལྟ་བས་ན་བདག་གིས་དེ་ལྟ་བུའི་འདུས་བྱས་ཉེས་པ་མང་པོའི་སྐྱོན་ཅན་ཤེས་པར་བྱས་ཏེ་འདུ་བ་དང་རྒྱུ་རྐྱེན་དང་ལྡན་པ་འདི་དག་རྒྱུན་གཅད་པར་བྱའོ། །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདུ་བྱེད་རྣམས་ཤིན་ཏུ་ཞི་བ་འང་མངོན་དུ་མི་བྱའོ་ཞེས་ཏེ།
en: We, thus knowing that composite phenomena are guilty of having many faults, shall put an end to their combinations and entireties, but in order to ripen beings we will not manifest the complete cessation of composite phenomena.’

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་དེ་ལྟར་འདུ་བྱེད་ཀྱི་རྣམ་པ་དེ་ལྟར་ཉེས་པ་མང་པོའི་སྐྱོན་ཅན་སྙིང་པོ་དང་རང་བཞིན་མེད་པ་སྐྱེ་བ་མེད་པ་འགག་པ་མེད་པའི་རང་བཞིན་དུ་རབ་ཏུ་རྟོག་པ་དང་སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་བསྒྲུབ་པ་དང་། སེམས་ཅན་ཡོངས་སུ་མི་གཏོང་བས་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མངོན་སུམ་ཞེས་བྱ་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་སྣང་བའི་ཚུལ་དུ་མངོན་སུམ་དུ་འགྱུར་རོ།
en: “O jinaputras! In that way, while comprehending the nature of that which is composite to be guilty of many faults, to be devoid of an inherent nature, and to be without birth or termination, he develops great compassion, he does not abandon beings, and by engaging with manifestation he manifests the state of the perfection of wisdom, which is called the manifestation of unimpeded wisdom

source: །དེ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་ཞིང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པས་སྣང་བར་གྱུར་ནས་ཀྱང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་སྡུད་པའི་རྐྱེན་ཉེ་བར་སྩོགས་ཤིང་ཡང་དག་པར་སྡུད་དོ།
en: “He who has that kind of wisdom, who manifests being in the state of the perfection of wisdom, accumulates the conditions for acquiring the factors for enlightenment.

source: །འདུས་བྱས་དང་འགྲོགས་པར་ཡང་མི་གནས་སོ།
en: He does not remain in involvement with that which is composite.

source: །འདུ་བྱེད་རྣམས་རང་བཞིན་གྱིས་ཞི་བ་ཡང་རབ་ཏུ་རྟོག་གོ །འོན་ཀྱང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་མ་རྫོགས་པའི་ཕྱིར་དེ་ལ་མི་གནས་ཏེ།
en: He regards the cessation that is the nature of composite phenomena, but he does not remain absorbed within that, so as not to be lacking in the factors for enlightenment.

source: དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་ཚེ་འཇུག་པ་སྟོང་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སྐྱེ་བར་འགྱུར་རོ། །རང་བཞིན་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། འདུ་བ་སྟོང་པ་ཉིད་དང་། མངོན་པར་བསྒྲུབ་པ་སྟོང་པ་ཉིད་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་རྟོག་པའི་སྟོང་པ་ཉིད་དང་། ལྟོས་པ་སྟོང་པ་ཉིད་དང་། ཐ་དད་པ་དང་ཐ་དད་པ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་སྐྱེ་བར་འགྱུར་ཏེ།
en: “When the bodhisattva is on the Manifested bodhisattva bhūmi, there arises the samādhi named entering emptiness . There also arise the samādhis named emptiness of inherent nature , ultimate emptiness , supreme emptiness , great emptiness , emptiness of engagement , emptiness of accomplishment , emptiness of correct comprehension , emptiness of dependency , emptiness of separation , and emptiness of nonseparation

source: དེ་དག་ལ་སྩོགས་པ་སྟོང་པ་ཉིད་ཀྱི་སྒོའི་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་དེ་ལ་མངོན་སུམ་དུ་འགྱུར་རོ།
en: There also manifest hundreds of thousands of other entrances into the samādhi of emptiness.

source: །དེ་བཞིན་དུ་མཚན་མ་མེད་པའི་སྒོའི་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་དང་སྨོན་པ་མེད་པའི་སྒོའི་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་མངོན་སུམ་དུ་འགྱུར་རོ།
en: In that way there also manifest hundreds of thousands of entrances into the samādhi of featurelessness and hundreds of thousands of entrances into the samādhi of aspirationlessness.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཕྱིར་ཞིང་མི་ཕྱེད་པའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པ་འཐོབ་པོ།
en: “Even more, the bodhisattva residing on this Manifested bodhisattva bhūmi completely attains undivided motivation.

source: །ངེས་པའི་བསམ་པ་དང་དགེ་བའི་བསམ་པ་དང་། ཟབ་པའི་བསམ་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་བསམ་པ་དང་། རྒྱུན་མི་འཆད་པའི་བསམ་པ་དང་། དྲི་མ་མེད་པའི་བསམ་པ་དང་། མཐའ་ཡས་པའི་བསམ་པ་དང་། ཡེ་ཤེས་ལ་མངོན་པར་མོས་པའི་བསམ་པ་དང་། ཐབས་དང་ཤེས་རབ་ཏུ་ལྡན་པའི་བསམ་པ་ཡོངས་སུ་རྫོགས་པ་འཐོབ་སྟེ།
en: He completely attains definite contemplation, good contemplation, profound motivation, irreversible motivation, uninterrupted motivation, stainless motivation, infinite motivation, motivation that aspires to wisdom, and motivation that has method and wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་འདི་བཅུ་ནི། དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཀྱི་རྗེས་སུ་སོང་བ་ཡིན།
en: Those ten motivations of the bodhisattva are in accord with the enlightenment of a tathāgata.

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་ཕྱིར་མི་ལྡོག་པ་ཡིན། ཡེ་ཤེས་ཀྱི་ས་ལ་ཡང་དག་པར་གཞོལ་བ་ཡིན།
en: “He cannot be countered by any opposing teacher; he reaches the bhūmi of wisdom;

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་རྣམ་པར་ལོག་པ་ཡིན།
en: he turns away from the śrāvaka and pratyekabuddha bhūmis;

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མངོན་དུ་བྱ་བ་ལ་ཤིན་ཏུ་ངེས་པ་ཡིན།
en: he solely manifests the wisdom of the buddhas;

source: བདུད་དང་ཉོན་མོངས་པ་ཀུན་ནས་རྒྱུ་བ་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་ཡིན།
en: he cannot be surpassed by any of the activities of the māras or kleśas;

source: བྱང་ཆུབ་སེམས་དཔའི་སྣང་བ་ལ་ཤིན་ཏུ་གནས་པ་ཡིན།
en: he remains in the light of a bodhisattva’s wisdom;

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་ཡང་དག་པར་སྤྱད་པ་ཡོངས་སུ་བསྒོམས་པ་ཡིན།
en: he is completely immersed in the practice of the Dharma of emptiness, featurelessness, and aspirationlessness;

source: ཐབས་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་རྣམ་པར་དཔྱད་པ་དང་ལྡན་པ་ཡིན།
en: he is engaged in analysis through method, wisdom, and knowledge;

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་མངོན་པར་བསྒྲུབ་པ་དང་། རྣམ་པར་འདྲེས་པ་ཡིན།
en: and he is permeated by the accomplishment of the factors for enlightenment.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་ཤས་ཆེ་བ་ཡིན། ཆོས་དེ་དག་ལ་ཚུལ་བཞིན་དུ་འཐུན་པར་བྱེད་ཅིང་མི་མཐུན་པར་མི་བྱེད་པས་འཐུན་པའི་བཟོད་པ་གསུམ་པ་རབ་ཏུ་རྣོ་བ་རབ་ཏུ་སྐྱེས་པ་ཡིན།
en: “Thus when he is on the Manifested bodhisattva bhūmi, there arises a superior state of the perfection of wisdom, and with the third sharp concordant patience he acts in accord with these qualities and not contrary to them.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་ཚེ་དེའི་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་སྣང་བར་འགྱུར་ཏེ།
en: “When he is in that way residing on this Manifested bodhisattva bhūmi, many buddhas will appear to him because of his vast view and the power of his prayers.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་སྣང་བར་འགྱུར་རོ།
en: Because of his vast view and the power of his prayers, many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him.

source: །དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །ན་བཟའ་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: He will see those tathāgatas, those arhats, those samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements. He will also offer all the articles that bring happiness to a bodhisattva.

source: །དགེ་འདུན་གྱི་ཚོགས་རྣམས་ལ་ཡང་ཡང་དག་པར་མཆོད་པ་བྱེད་དེ་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: He will also offer to the assemblies of the Saṅgha. He will dedicate all those roots of goodness to the highest complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་རིམ་གྲོ་དང་། བཀུར་སྟིས་ནན་ཏན་ཏུ་ཆོས་ཉན་ཅིང་ལེན་ཏོ། །འཛིན་ཏོ།
en: He serves those tathāgata arhat samyak­sambuddhas, and he listens to the Dharma with respect, reverence, and honor and remembers it.

source: །ཐོས་ནས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བས་རབ་ཏུ་བརྩོན་པར་བྱེད་དེ་ནན་ཏན་གྱིས་ཡོངས་སུ་འཛིན་པས་དེ་སྔོན་པས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: Having heard it he correctly applies himself to the light of meditation, wisdom, and knowledge and possesses its attainment. He becomes, even more than before, someone who possesses the treasure of the Dharma of the tathāgatas.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་མངོན་སུམ་འདི་ལ་གནས་པའི་ཚེ།
en: “The roots of goodness of the bodhisattva who resides on the bodhisattva bhūmi Manifested become purer, clearer, and brighter over many eons.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་སྔོན་བས་ཀྱང་ཆེས་བྱང་བ་དང་། ཅེས་འོད་གསལ་ཞིང་དང་བར་གནས་སོ།
en: They become purer, clearer, and brighter over many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many millions of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons.
